[
  {
    "path": "posts/2026-01-26-module-3-assignment/",
    "title": "Module 3 Assignment",
    "description": "Testing, Reading, and using Photoshop or any other image app",
    "author": [
      {
        "name": "Skylar Walsh",
        "url": {}
      }
    ],
    "date": "2026-01-26",
    "categories": [],
    "contents": "\r\nTest and see if the code is correct.\r\nReport your finding in your blog and describe what is the object and what are the variables in that code.\r\nThe logic and the syntax in the code runs correctly when both the script tags and the p tags are within the body tag of my HTML page. The code initializes two numerical values, sums them, and inserts a string containing the result into an HTML element with the ID called “demo”.\r\nVariables are containers for storing data values. In my code, “var” was used to declare three distinct variable names. The first variable is “price1”, which is a variable holding an integer value of 5. The second variable is “price2”, which is a variable holding an integer value of 6. The third variable is “total”, which is a variable that stores the result of the expression “price1 + price2”, and when I ran it on the web, it evaluated to 11.\r\nIn the code, the main object is “document”, which is a built-in object provided by the browser, and this is the entryway to the web page’s content.\r\nI realized from my Eloquent JavaScript readings that even though “var” works fine for declaring variables, JavaScript generally uses “let” for variables that might change and “const” for variables that stay the same.\r\nRead Chapter 2-4 in our textbook: Eloquent JavaScript\r\nCreate one image in Photoshop/or any image apps you like and save the file as 1) PNG, 2) GIF and 3) JPG. Post the three image files on your website under Module # 3. Then test to see, which image format (PNG, GIF, and JPG) work best regarding: The quality of the image, the speed the image download to the browser and the image transparency to desktop computer and mobile phone. In your blog, discuss your findings regarding the quality, speed and transparency of the images.\r\nHere are the resulting images:\r\n.jpg\r\n\r\n.png\r\n\r\n.gif\r\n\r\nStarting with the quality of the image, my PNG image used lossless compression and retained every pixel of the data. The image was good for clarity, even though the file size was large. For the GIF image, I noticed that the image had limited colors, which means that GIF image quality will only be good if the image were to be smaller. For the JPG image, it used lossy compression. The image appeared to remove some data to shrink the file size. While it is great as a photograph, it created some blocks of white on the edges of the image.\r\nThe next concept of image format that I tested is the speed. The file was heavy when I downloaded the PNG version of the image. A high-quality PNG can be much larger than a JPG. This slowed down page load times on my phone. For the GIF image, it had effective speed, but if it had larger animations, the speed would be much slower. The JPG image was the best for speed when I downloaded and opened the image as that file type. Because it was lossy, I was able to shrink the photo to speed up its performance of being displayed and downloaded.\r\nThe final concept of image format that I tested is transparency. My PNG image worked best for transparency. It was able to handle semi-transparent and faded edges the most. For the GIF image, the transparency was good, but I realized that its format is really old, which means it has a limited palette structure. For the JPG image, there was no transparency support. The JPG was rectangular, and the empty space was filled with solid white.\r\n\r\n\r\n\r\n",
    "preview": "https://github.com/skywalshUSF/LIS4365_Blog/blob/main/_posts/2026-01-26-module-3-assignment/EvergladesWaterStreamsJPG.jpg?raw=true",
    "last_modified": "2026-01-26T19:36:05-05:00",
    "input_file": "module-3-assignment.knit.md"
  },
  {
    "path": "posts/2026-01-19-module-2-assignment/",
    "title": "Module 2 Assignment",
    "description": "Creating first website homepage using HTML and CSS.",
    "author": [
      {
        "name": "Skylar Walsh",
        "url": {}
      }
    ],
    "date": "2026-01-19",
    "categories": [],
    "contents": "\r\nCreate your first website homepage using HTML and Cascading Style Sheet (CSS) and upload it to your website. Upload those files to your website using FTP only. Then, post in your blog the difficulties you encounter. For example, problems with HTML editor, problems with hosting website, etc.\r\nHere is the link to my website’s homepage:\r\nhttps://skylarwalshlis4365.infinityfree.me/?i=1\r\nThe first thing I did was revisit some of the HTML code, CSS styling, and JavaScript techniques that I learned about in LIS 3361. I opened up my favorite text editor, Notepad++, after reading the assigned text, and looked over all of the code I wrote for the many files that made up my website. Some of the HTML and CSS was helpful to create the new website. After creating my webpages and style sheet, I used the FTP file manager provided by Infinity Free to upload my documents to the hosting service. I started with a home page and set it up similar to LIS 3361 with a navigation link column on the left frame and a content frame on the right. I set up the home page to display module 1 and then added links for module 2 and the new module 3 page. On the module 2 page, I added a link to the module 3 page and some simple JavaScript, and on the module 3 page, I added the required title, name, and simple JavaScript example.\r\nHere is the link to module 2 assignment:\r\nhttps://skylarwalshlis4365.infinityfree.me/Module2.html\r\nAnd the link to the new module 3 page:\r\nhttps://skylarwalshlis4365.infinityfree.me/Module3.html\r\nLearning HTML and CSS presents me with some unique challenges. JavaScript is similarly confusing, and it is a language full of unfamiliar quirks. Some of the challenges I faced involved where to embed JavaScript tags, understanding the layout and positioning of style sheets, and syntax for HTML and CSS. Figuring out where to embed JavaScript tags, especially adding a link in JavaScript within a script tag, was particularly hard. It is not always easy getting a web page to link to another web page on the same website. The second challenge, understanding the layout, required a lot of thought because I have to make sure my text elements are aligned properly while changing text size and style of a hyperlink and paragraphs. The third challenge, syntax, can almost easily be encountered. Sometimes, I miss a semicolon in CSS or forget to close a tag in HTML that causes my layout to be broken, which requires a lot of debugging if I make that mistake. I do, however, believe I can overcome these challenges and become interested in learning these software applications more closely, including additional ones, such as PHP and MySQL.\r\n\r\n\r\n\r\n",
    "preview": "https://github.com/skywalshUSF/LIS4365_Blog/blob/main/_posts/2026-01-19-module-2-assignment/html-js-css-website-coding.jpg?raw=true",
    "last_modified": "2026-01-19T11:07:25-05:00",
    "input_file": "module-2-assignment.knit.md"
  },
  {
    "path": "posts/2026-01-09-module-1-assignment/",
    "title": "Module 1 Assignment",
    "description": "Blog Setup and Website Link",
    "author": [
      {
        "name": "Skylar Walsh",
        "url": {}
      }
    ],
    "date": "2026-01-09",
    "categories": [],
    "contents": "\r\nOpen an account on our web hosting site:\r\nWelcome to my new website for LIS4365 hosted on infinityfree.net.\r\nHere is the link to my website:\r\nhttps://skylarwalshlis4365.infinityfree.me/\r\nCreate a blog where you will share your own experience in the class in your own words.\r\nHere is the link to my new blog:\r\nhttps://skylarwalshlis4365.netlify.app/\r\nDescribe what was hard to learn in this module, are you familiar with programming languages?\r\nIn this module, I recognized that the syntax for JavaScript may be different from other programming languages that I have learned, which made it hard for me to understand how to write certain pieces of code in JavaScript. For instance, in most programming languages, typing the print() or println() function would allow the program to display output, but in JavaScript, console.log() is used for that purpose, and I also noticed that I do not have to specify a data type in JavaScript when calling or declaring variables. Instead, I can simply type “let” instead of just int or char to define a binding. There are many programming languages I am familiar with, such as Python, Java, and R. I still have experience with many basic programming concepts, such as data types, control structures like loops, conditional statements, and writing functions.\r\nWhat is your experience with web development? etc.\r\nMy experience with web development began with creating my first domain name for a website and taking a World Wide Web page design and management course, where I explored basic HTML syntax, which allowed me to understand text documents that contain formatting instructions called tags, learn how to add information contained within an element’s opening and closing tags, and determine which elements do not require a closing tag. Throughout this experience, I also became more familiar with FTP, file transfer protocol and expanded my knowledge on iframes and basic javascript for messages and a webform.\r\nYour first entry to your blog is your link to your website address you will use in this class https://skylarwalshlis4365.infinityfree.me/ that displays the following image:\r\n\r\n\r\n\r\n\r\n",
    "preview": "https://github.com/skywalshUSF/LIS4365_Blog/blob/main/_posts/2026-01-09-module-1-assignment/LIS4365_Module1.jpg?raw=true",
    "last_modified": "2026-01-09T13:07:58-05:00",
    "input_file": "module-1-assignment.knit.md"
  }
]
