[
  {
    "path": "posts/2026-01-09-module-1-assignment/",
    "title": "Module 1 Assignment",
    "description": "Blog Setup and Website Link",
    "author": [
      {
        "name": "Skylar Walsh",
        "url": {}
      }
    ],
    "date": "2026-01-09",
    "categories": [],
    "contents": "\r\nOpen an account on our web hosting site:\r\nWelcome to my new website for LIS4365 hosted on infinityfree.net.\r\nHere is the link to my website:\r\nhttps://skylarwalshlis4365.infinityfree.me/\r\nCreate a blog where you will share your own experience in the class in your own words.\r\nHere is the link to my new blog:\r\nhttps://skylarwalshlis4365.netlify.app/\r\nDescribe what was hard to learn in this module, are you familiar with programming languages?\r\nIn this module, I recognized that the syntax for JavaScript may be different from other programming languages that I have learned, which made it hard for me to understand how to write certain pieces of code in JavaScript. For instance, in most programming languages, typing the print() or println() function would allow the program to display output, but in JavaScript, console.log() is used for that purpose, and I also noticed that I do not have to specify a data type in JavaScript when calling or declaring variables. Instead, I can simply type “let” instead of just int or char to define a binding. There are many programming languages I am familiar with, such as Python, Java, and R. I still have experience with many basic programming concepts, such as data types, control structures like loops, conditional statements, and writing functions.\r\nWhat is your experience with web development? etc.\r\nMy experience with web development began with creating my first domain name for a website and taking a World Wide Web page design and management course, where I explored basic HTML syntax, which allowed me to understand text documents that contain formatting instructions called tags, learn how to add information contained within an element’s opening and closing tags, and determine which elements do not require a closing tag. Throughout this experience, I also became more familiar with web communication protocols and expanded my knowledge on XML and HTML.\r\nYour first entry to your blog is your link to your website address you will use in this class https://skylarwalshlis4365.infinityfree.me/ that displays the following image:\r\n\r\n\r\n\r\n\r\n",
    "preview": "https://github.com/skywalshUSF/LIS4365_Blog/blob/main/_posts/2026-01-09-module-1-assignment/LIS4365_Module1.jpg?raw=true",
    "last_modified": "2026-01-09T12:58:45-05:00",
    "input_file": "module-1-assignment.knit.md"
  }
]
