[
  {
    "path": "posts/2026-02-16-module-6-and-7-assignment/",
    "title": "Module 6 and 7 Assignment",
    "description": "Introduction to PHP Functions and Strings",
    "author": [
      {
        "name": "Skylar Walsh",
        "url": {}
      }
    ],
    "date": "2026-02-16",
    "categories": [],
    "contents": "\r\nThese are responses to our module 6 and 7 tasks:\r\nCreate any type of function and string I covered in both presentations. Implement it and execute it on your testing on your website server. Remember to save the file as .PHP and not HTML. You will upload this assignment to your web server in order to review.\r\nHere is a link to the module 6 and 7 webpage that runs the .php file tests:\r\nhttps://skylarwalshlis4365.infinityfree.me/Modules6and7.html\r\nIn your blog entry discuss the connection between functions and strings in PHP and discuss how you implemented functions and strings in your assignment.\r\nIn modules 6 and 7, I explored two of the most basic building blocks of any programming language: functions and strings.\r\nThere is a connection between them. In the world of PHP, if a string is the data, then a function is the action. Strings allow us to store text, but they are rarely static. We often need to format, combine, or display them conditionally.\r\nThis is where functions come in. A function is a reusable block of code designed to perform a specific task. By wrapping string logic inside a function, we can write one function that accepts different strings as inputs and outputs them perfectly formatted every time.\r\nFor this assignment, I showed these concepts through two independent tests:\r\nThe first test was the function test, where I created a custom function called displayCompanyName(). Inside this function, I declared a string variable $Company1 containing “University of South Florida.” I then used the echo command to wrap that string in HTML tags. This showed how functions can encapsulate brand information and display it consistently.\r\n\r\nThe second test was the string test, where I treated the string “Hello!” as an array, pulling out individual characters and then stitching them back together. I then broke a full sentence into three separate values and used the dot operator (.) to merge them into a single cohesive paragraph.\r\n\r\nTo keep my main webpage clean, I used an HTML iframe to display the results. When a user clicks the “Run Test” button, the browser sends a request to the PHP files on the server, which execute the logic and send the result back to the frame.\r\n\r\n\r\n\r\n\r\n",
    "preview": "https://github.com/skywalshUSF/LIS4365_Blog/blob/main/_posts/2026-02-16-module-6-and-7-assignment/phptest1.png?raw=true",
    "last_modified": "2026-02-16T08:50:53-05:00",
    "input_file": "module-6-and-7-assignment.knit.md"
  },
  {
    "path": "posts/2026-02-11-module-5-assignment/",
    "title": "Module 5 Assignment",
    "description": "JavaScript Validation and WireFrame Design",
    "author": [
      {
        "name": "Skylar Walsh",
        "url": {}
      }
    ],
    "date": "2026-02-11",
    "categories": [],
    "contents": "\r\nHere is a link to the module 5 webpage:\r\nhttps://skylarwalshlis4365.infinityfree.me/Module5.html\r\nThese are responses to our module 5 tasks:\r\nFor the Web Programming\r\nThe instructions asked us to design our own HTML form and apply JavaScript principles to validate and examineuser input. Then, post it on my website. I completed this task, and the link above directs visitors to a webpage with a form that looks like this: \r\nFor the Web designers\r\n2. Design your own wireframe by using any of the software/app you prefer. Your design needs to incorporate boxes, logo and footer. In your blog, provide in depth discussion to the rationale and implementation of your design process.\r\nThis is an image of my wireframe that contains a variety of content elements, including, in this order, a header, hero section, stats, main content, a call to action, and a footer:\r\nThis wireframe focuses on the layout of a non-profit organization.\r\n\r\nIn this discussion of the rationale for my design process, the wireframe focuses mainly on user interactivity. It is divided into sections for various content elements, creating a trustworthy and engaging layout. By placing the logo, which in this case is a square with an X, in the top-left corner and adding an interactive button in the hero section (Donate Now), the layout clearly shows the non-profit’s goal: fundraising. The hero section uses a large box with a full-width background imageto create an emotional connection with the audience, while the three small horizontal “Impact Stats” boxes provide engaging, quantitative facts about the charity. With this structure, the layout will help visitors understand the organization’s mission statement and its efficiency while visiting the page.\r\nThe implementation of my design process for this wireframe relies on an appropriate zoom level and marginal lines, as the design should be easily organized and support devices of any screen size that use a web browser. The clear separation of content into individual boxes, such as the main content and the call to action, creates a flow that avoids overwhelming the reader with too much information. The footer contains legal information, contact details, icons, and links arranged in separate boxes to maintain clarity. By making white space and separation between sections of the layout a top priority in my design, I reduce cognitive load in my wireframe and ensure it has purpose, making it easier for donors and participants to interact with the user-centric design and take constructive action.\r\n\r\n\r\n\r\n",
    "preview": "https://github.com/skywalshUSF/LIS4365_Blog/blob/main/_posts/2026-02-11-module-5-assignment/mod5form.png?raw=true",
    "last_modified": "2026-02-11T15:21:18-05:00",
    "input_file": "module-5-assignment.knit.md"
  },
  {
    "path": "posts/2026-02-02-module-4-assignment/",
    "title": "Module 4 Assignment",
    "description": "Creating conditional statement, Debugging JavaScipt code, and Adobe Photoshop",
    "author": [
      {
        "name": "Skylar Walsh",
        "url": {}
      }
    ],
    "date": "2026-02-02",
    "categories": [],
    "contents": "\r\nHere is a link to the module 4 webpage:\r\nhttps://skylarwalshlis4365.infinityfree.me/Module4.html\r\nThese are responses to our module 4 tasks:\r\nFor the Web Programming\r\nCreate your own condition (you can use the if, or if-else condition) in JavaScript and run it on your website. Your script needs to be customized and not copy and paste from my power-point/page. Plus discuss in your blog what was easy and what was hard in creating the if conditions. Read again chapter 3 in our textbook: Eloquent JavaScript\r\nThis is the JavaScript code for my very own “if-else” condition that was customized:\r\n<p id=\"demo\"><\/p>\r\n<script>\r\n// Set temperature variable\r\nlet temperature = 72;\r\n\r\n// Print message according to conditional test\r\n  if (temperature > 85) {\r\n              var txt = \"It's a hot one!\";\r\n              document.getElementById(\"demo\").innerHTML = txt;\r\n  } else if (temperature > 60) {\r\n              var txt = \"The temperature is: \" + temperature + \"°F The weather is pleasant.\";\r\n              document.getElementById(\"demo\").innerHTML = txt;\r\n    } else {\r\n              var txt = \"It's a bit chilly.\";\r\n              document.getElementById(\"demo\").innerHTML = txt;\r\n    }\r\n<\/script>\r\nThere were both easy and hard tasks for creating the if conditions. The easy part about creating if conditions is that the else and else if keywords allow me to have clear logic in my code, as well as being able to extend that logic. Additionally, I learned that I can use variables directly in the condition without any type checks.\r\nThe hard part about creating if conditions is that it can be tricky to figure out where to put curly braces. Just like the example code I had to fix in task 2, if curly braces are in the wrong spot or do not appear within an important scope, this can lead to an unexpected error. Similarly, if I omitted curly braces in an arrow function, that can also cause a syntax error because JavaScript interprets a beginning curly brace as the start of a function block. It is also hard to read, maintain, and debug if-else statements that have too many nested conditions. This is another reason I may have trouble placing curly braces in the right spot.\r\nFix the code in this example and post the result in your blog\r\n<!DOCTYPE html>\r\n<html>\r\n<body>\r\n\r\n<p id=\"demo\">Display the result here.<\/p>\r\n\r\n<script>\r\nvar greeting;\r\nvar hour = new Date().getHours();\r\n\r\nif (hour < 18) {\r\ngreeting = \"Good day\";\r\nelse\r\ngreeting = \"Good evening\";\r\n}\r\n\r\ndocument.getElementById(\"demo\").innerHTML = greeting;\r\n<\/script>\r\n\r\n<\/body>\r\n<\/html>\r\nThe result is: Display the result here.\r\nThis means the error occurred in the script tag. The problem seems to be that the curly braces are missing from the “else” line.\r\nThis is the corrected code:\r\n    <!DOCTYPE html>\r\n        <html>\r\n        <body>\r\n\r\n        <p id=\"demo\">Display the result here.<\/p>\r\n\r\n        <script>\r\n        var greeting;\r\n        var hour = new Date().getHours();\r\n\r\n        if (hour < 18) {\r\n        greeting = \"Good day\";\r\n        }else{\r\n        greeting = \"Good evening\";\r\n        }\r\n\r\n        document.getElementById(\"demo\").innerHTML = greeting;\r\n        <\/script>\r\n\r\n        <\/body>\r\n        <\/html>\r\nThe result is: Good day\r\nDownload any image from the web and use Photoshop and save it for the Web.\r\nPost the result on your blog and discuss your experience with Adobe Photoshop. Make sure to go over all the tutorials USF provided on the subject.\r\nThis is the resulting image after using Photoshop to save it for the Web:\r\n\r\nMy experience with Adobe Photoshop is fundamental. I took a class that involved creating digital art images on this platform before starting college, and I gained basic skills in digital image editing and photo manipulation. The main experiences for me at that time were learning about layers, masking, selection tools, and basic color correction to edit, retouch, and improve photos. I once created logos and surreal images with this application. Although the only best experiences I have right now for Photoshop are photo editing (cropping photos and using some other specific tools on them) and how to format and save images correctly, I am now familiar with saving an image for web use and making sure that the resolution is appropriate for posting it onto the Web.\r\n\r\n\r\n\r\n",
    "preview": "https://github.com/skywalshUSF/LIS4365_Blog/blob/main/_posts/2026-02-02-module-4-assignment/demonstrate.jpg?raw=true",
    "last_modified": "2026-02-02T17:56:43-05:00",
    "input_file": "module-4-assignment.knit.md"
  },
  {
    "path": "posts/2026-01-26-module-3-assignment/",
    "title": "Module 3 Assignment",
    "description": "Testing, Reading, and using Photoshop or any other image app",
    "author": [
      {
        "name": "Skylar Walsh",
        "url": {}
      }
    ],
    "date": "2026-01-26",
    "categories": [],
    "contents": "\r\nHere is a link to the home page of my website that includes a link to the module 3 page:\r\nhttps://skylarwalshlis4365.infinityfree.me/?i=2\r\nThese are responses to our module 3 tasks:\r\nTest and see if the code is correct.\r\nReport your finding in your blog and describe what is the object and what are the variables in that code.\r\nThe logic and the syntax in the code runs correctly when both the script tags and the p tags are within the body tag of my HTML page. The code initializes two numerical values, sums them, and inserts a string containing the result into an HTML element with the ID called “demo”.\r\nVariables are containers for storing data values. In my code, “var” was used to declare three distinct variable names. The first variable is “price1”, which is a variable holding an integer value of 5. The second variable is “price2”, which is a variable holding an integer value of 6. The third variable is “total”, which is a variable that stores the result of the expression “price1 + price2”, and when I ran it on the web, it evaluated to 11.\r\nIn the code, the main object is “document”, which is a built-in object provided by the browser, and this is the entryway to the web page’s content.\r\nI realized from my Eloquent JavaScript readings that even though “var” works fine for declaring variables, JavaScript generally uses “let” for variables that might change and “const” for variables that stay the same.\r\nRead Chapter 2-4 in our textbook: Eloquent JavaScript\r\nCreate one image in Photoshop/or any image apps you like and save the file as 1) PNG, 2) GIF and 3) JPG. Post the three image files on your website under Module # 3. Then test to see, which image format (PNG, GIF, and JPG) work best regarding: The quality of the image, the speed the image download to the browser and the image transparency to desktop computer and mobile phone. In your blog, discuss your findings regarding the quality, speed and transparency of the images.\r\nHere are the resulting images:\r\n.jpg\r\n\r\n.png\r\n\r\n.gif\r\n\r\nStarting with the quality of the image, my PNG image used lossless compression and retained every pixel of the data. The image was good for clarity, even though the file size was large. For the GIF image, I noticed that the image had limited colors, which means that GIF image quality will only be good if the image were to be smaller. For the JPG image, it used lossy compression. The image appeared to remove some data to shrink the file size. While it is great as a photograph, it created some blocks of white on the edges of the image.\r\nThe next concept of image format that I tested is the speed. The file was heavy when I downloaded the PNG version of the image. A high-quality PNG can be much larger than a JPG. This slowed down page load times on my phone. For the GIF image, it had effective speed, but if it had larger animations, the speed would be much slower. The JPG image was the best for speed when I downloaded and opened the image as that file type. Because it was lossy, I was able to shrink the photo to speed up its performance of being displayed and downloaded.\r\nThe final concept of image format that I tested is transparency. My PNG image worked best for transparency. It was able to handle semi-transparent and faded edges the most. For the GIF image, the transparency was good, but I realized that its format is really old, which means it has a limited palette structure. For the JPG image, there was no transparency support. The JPG was rectangular, and the empty space was filled with solid white.\r\n\r\n\r\n\r\n",
    "preview": "https://github.com/skywalshUSF/LIS4365_Blog/blob/main/_posts/2026-01-26-module-3-assignment/EvergladesWaterStreamsJPG.jpg?raw=true",
    "last_modified": "2026-01-27T08:06:28-05:00",
    "input_file": "module-3-assignment.knit.md"
  },
  {
    "path": "posts/2026-01-19-module-2-assignment/",
    "title": "Module 2 Assignment",
    "description": "Creating first website homepage using HTML and CSS.",
    "author": [
      {
        "name": "Skylar Walsh",
        "url": {}
      }
    ],
    "date": "2026-01-19",
    "categories": [],
    "contents": "\r\nCreate your first website homepage using HTML and Cascading Style Sheet (CSS) and upload it to your website. Upload those files to your website using FTP only. Then, post in your blog the difficulties you encounter. For example, problems with HTML editor, problems with hosting website, etc.\r\nHere is the link to my website’s homepage:\r\nhttps://skylarwalshlis4365.infinityfree.me/?i=1\r\nThe first thing I did was revisit some of the HTML code, CSS styling, and JavaScript techniques that I learned about in LIS 3361. I opened up my favorite text editor, Notepad++, after reading the assigned text, and looked over all of the code I wrote for the many files that made up my website. Some of the HTML and CSS was helpful to create the new website. After creating my webpages and style sheet, I used the FTP file manager provided by Infinity Free to upload my documents to the hosting service. I started with a home page and set it up similar to LIS 3361 with a navigation link column on the left frame and a content frame on the right. I set up the home page to display module 1 and then added links for module 2 and the new module 3 page. On the module 2 page, I added a link to the module 3 page and some simple JavaScript, and on the module 3 page, I added the required title, name, and simple JavaScript example.\r\nHere is the link to module 2 assignment:\r\nhttps://skylarwalshlis4365.infinityfree.me/Module2.html\r\nAnd the link to the new module 3 page:\r\nhttps://skylarwalshlis4365.infinityfree.me/Module3.html\r\nLearning HTML and CSS presents me with some unique challenges. JavaScript is similarly confusing, and it is a language full of unfamiliar quirks. Some of the challenges I faced involved where to embed JavaScript tags, understanding the layout and positioning of style sheets, and syntax for HTML and CSS. Figuring out where to embed JavaScript tags, especially adding a link in JavaScript within a script tag, was particularly hard. It is not always easy getting a web page to link to another web page on the same website. The second challenge, understanding the layout, required a lot of thought because I have to make sure my text elements are aligned properly while changing text size and style of a hyperlink and paragraphs. The third challenge, syntax, can almost easily be encountered. Sometimes, I miss a semicolon in CSS or forget to close a tag in HTML that causes my layout to be broken, which requires a lot of debugging if I make that mistake. I do, however, believe I can overcome these challenges and become interested in learning these software applications more closely, including additional ones, such as PHP and MySQL.\r\n\r\n\r\n\r\n",
    "preview": "https://github.com/skywalshUSF/LIS4365_Blog/blob/main/_posts/2026-01-19-module-2-assignment/html-js-css-website-coding.jpg?raw=true",
    "last_modified": "2026-01-19T11:07:25-05:00",
    "input_file": "module-2-assignment.knit.md"
  },
  {
    "path": "posts/2026-01-09-module-1-assignment/",
    "title": "Module 1 Assignment",
    "description": "Blog Setup and Website Link",
    "author": [
      {
        "name": "Skylar Walsh",
        "url": {}
      }
    ],
    "date": "2026-01-09",
    "categories": [],
    "contents": "\r\nOpen an account on our web hosting site:\r\nWelcome to my new website for LIS4365 hosted on infinityfree.net.\r\nHere is the link to my website:\r\nhttps://skylarwalshlis4365.infinityfree.me/\r\nCreate a blog where you will share your own experience in the class in your own words.\r\nHere is the link to my new blog:\r\nhttps://skylarwalshlis4365.netlify.app/\r\nDescribe what was hard to learn in this module, are you familiar with programming languages?\r\nIn this module, I recognized that the syntax for JavaScript may be different from other programming languages that I have learned, which made it hard for me to understand how to write certain pieces of code in JavaScript. For instance, in most programming languages, typing the print() or println() function would allow the program to display output, but in JavaScript, console.log() is used for that purpose, and I also noticed that I do not have to specify a data type in JavaScript when calling or declaring variables. Instead, I can simply type “let” instead of just int or char to define a binding. There are many programming languages I am familiar with, such as Python, Java, and R. I still have experience with many basic programming concepts, such as data types, control structures like loops, conditional statements, and writing functions.\r\nWhat is your experience with web development? etc.\r\nMy experience with web development began with creating my first domain name for a website and taking a World Wide Web page design and management course, where I explored basic HTML syntax, which allowed me to understand text documents that contain formatting instructions called tags, learn how to add information contained within an element’s opening and closing tags, and determine which elements do not require a closing tag. Throughout this experience, I also became more familiar with FTP, file transfer protocol and expanded my knowledge on iframes and basic javascript for messages and a webform.\r\nYour first entry to your blog is your link to your website address you will use in this class https://skylarwalshlis4365.infinityfree.me/ that displays the following image:\r\n\r\n\r\n\r\n\r\n",
    "preview": "https://github.com/skywalshUSF/LIS4365_Blog/blob/main/_posts/2026-01-09-module-1-assignment/LIS4365_Module1.jpg?raw=true",
    "last_modified": "2026-01-09T13:07:58-05:00",
    "input_file": "module-1-assignment.knit.md"
  }
]
